## production: api_gateway
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-12-01T15:51:11Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:820252213580:2aluui7fbb/" -> (known after apply)
      ~ id            = "0wagyh" -> (known after apply)
      ~ invoke_url    = "https://2aluui7fbb.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-12-01T15:51:11Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "0wagyh" -> (known after apply)
        id                    = "ags-2aluui7fbb-production"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_wafv2_regex_pattern_set.anything will be created
  + resource "aws_wafv2_regex_pattern_set" "anything" {
      + arn         = (known after apply)
      + description = "Regex to match all"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "MatchAll"
      + scope       = "REGIONAL"
      + tags_all    = (known after apply)

      + regular_expression {
          + regex_string = ".+"
        }
    }

  # aws_wafv2_web_acl.metrics_collection will be updated in-place
  ~ resource "aws_wafv2_web_acl" "metrics_collection" {
        id          = "2f8c89fb-c923-4d2b-91c0-48d3d183162b"
        name        = "metrics_collection1"
        tags        = {}
        # (6 unchanged attributes hidden)


      - rule {
          - name     = "metrics_collection_max_body_size" -> null
          - priority = 12 -> null

          - action {

              - block {
                  - custom_response {
                      - response_code = 200 -> null

                      - response_header {
                          - name  = "waf-block" -> null
                          - value = "metrics_collection_max_body_size" -> null
                        }
                    }
                }
            }

          - statement {

              - size_constraint_statement {
                  - comparison_operator = "GT" -> null
                  - size                = 120000 -> null

                  - field_to_match {

                      - body {}
                    }

                  - text_transformation {
                      - priority = 1 -> null
                      - type     = "NONE" -> null
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "metrics_collection_max_body_size" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "metrics_collection_max_body_size"
          + priority = 13

          + action {

              + block {
                  + custom_response {
                      + response_code = 200

                      + response_header {
                          + name  = "waf-block"
                          + value = "metrics_collection_max_body_size"
                        }
                    }
                }
            }

          + statement {

              + size_constraint_statement {
                  + comparison_operator = "GT"
                  + size                = 120000

                  + field_to_match {

                      + body {}
                    }

                  + text_transformation {
                      + priority = 1
                      + type     = "NONE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "metrics_collection_max_body_size"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "metrics_collection_invalid_path"
          + priority = 10

          + action {

              + block {
                  + custom_response {
                      + response_code = 204
                    }
                }
            }

          + statement {

              + not_statement {
                  + statement {

                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "/save-metrics"

                          + field_to_match {

                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "metrics_collection_invalid_path"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "metrics_collection_query_strings"
          + priority = 11

          + action {

              + block {
                  + custom_response {
                      + response_code = 204
                    }
                }
            }

          + statement {

              + regex_pattern_set_reference_statement {
                  + arn = (known after apply)

                  + field_to_match {

                      + query_string {}
                    }

                  + text_transformation {
                      + priority = 1
                      + type     = "NONE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "metrics_collection_query_strings"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "metrics_collection_rate_limit" -> null
          - priority = 11 -> null

          - action {

              - block {
                }
            }

          - statement {

              - rate_based_statement {
                  - aggregate_key_type = "IP" -> null
                  - limit              = 10000 -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "metrics_collection_rate_limit" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "metrics_collection_rate_limit"
          + priority = 12

          + action {

              + block {
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 10000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "metrics_collection_rate_limit"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }

        # (6 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url = "https://2aluui7fbb.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>